
Процедура Печать(ТабДок, Ссылка) Экспорт
	НомерСтроки = 0;
	
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Ссылка КАК Ссылка,
	|	РеализацияТоваров.Номер КАК Номер,
	|	РеализацияТоваров.Дата КАК Дата,
	|	РеализацияТоваров.Контрагент КАК Контрагент,
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Сумма КАК Сумма
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|		ПО РеализацияТоваров.Ссылка = РеализацияТоваровТовары.Ссылка
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);

	ВставлятьРазделительСтраниц = Ложь;
	Пока ВыборкаДокумент.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(ВыборкаДокумент);
		ТабДок.Вывести(Шапка);
		ТабДок.Вывести(ОбластьТоварыШапка);
		
		ВыборкаТовары = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		СуммаИтого = 0;
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары);
			СуммаИтого = СуммаИтого + ВыборкаТовары.Сумма;
		КонецЦикла;

		Подвал.Параметры.ИтогоСумма = СуммаИтого;
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
