
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена = ОбщегоНазначенияКлиент.ПолучитьЦену(ТекущаяСтрока.Номенклатура, Объект.Дата, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры
