
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записать();
	Движения.ВзаиморасчетыСКонтрагентами.Записать();
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровТовары.Ссылка.Контрагент КАК Контрагент,
		|	ПоступлениеТоваровТовары.Ссылка.Договор КАК Договор,
		|	СУММА(ПоступлениеТоваровТовары.Количество) КАК Количество,
		|	СУММА(ПоступлениеТоваровТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		|ГДЕ
		|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровТовары.Ссылка.Контрагент,
		|	ПоступлениеТоваровТовары.Ссылка.Договор,
		|	ПоступлениеТоваровТовары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движение = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Выборка.Контрагент;
		Движение.Договор = Выборка.Договор;
		Движение.Сумма = Выборка.Сумма;
		
		// регистр ОстаткиТоваров Приход
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		Движение.Себестоимость = Выборка.Сумма
		
	КонецЦикла;
	
КонецПроцедуры


