
Функция ПолучитьАктуальнуюЦену(Номенклатура, Дата, Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
		
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.Закупочная);
	Иначе
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.Розничная);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;

КонецФункции