
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
		|	УстановкаЦенТовары.Цена КАК Цена,
		|	УстановкаЦенТовары.Ссылка.ВидЦены КАК ВидЦены,
		|	&Период КАК Период
		|ИЗ
		|	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
		|ГДЕ
		|	УстановкаЦенТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	
КонецПроцедуры

