
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюНаКлиенте.РасчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюНаКлиенте.РасчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена = РаботаСТабличнойЧастьюНаКлиенте.ПолучитьАктуальнуюЦену(ТекущаяСтрока.Номенклатура, Объект.Дата, Объект.Ссылка);
КонецПроцедуры

