"ВЫБРАТЬ
|	рАналитикаУчетаПоПартнерам.Партнер КАК Клиент,
|	МАКСИМУМ(ВыручкаИСебестоимостьПродажОбороты.Период) КАК ПоследняяДатаПродажи,
|	-РАЗНОСТЬДАТ(&ТекущаяДата, МАКСИМУМ(ВыручкаИСебестоимостьПродажОбороты.Период), ДЕНЬ) КАК ДнейБезПокупок
|ИЗ
|	РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
|		ПО рАналитикаУчетаПоПартнерам.КлючАналитики = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам
|ГДЕ
|	ВыручкаИСебестоимостьПродажОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
|	И рАналитикаУчетаПоПартнерам.Партнер.Клиент
|	И НЕ рАналитикаУчетаПоПартнерам.Партнер.ПометкаУдаления
|
|СГРУППИРОВАТЬ ПО
|	рАналитикаУчетаПоПартнерам.Партнер
|
|УПОРЯДОЧИТЬ ПО
|	ДнейБезПокупок УБЫВ"