
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена = ОбщегоНазначенияКлиент.ПолучитьЦену(ТекущаяСтрока.Номенклатура, Объект.Дата, Объект.Ссылка);
	ПриИзмененииЦены();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПриИзмененииЦены();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнойЧастьюКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСрокГодностиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ДанныеВыбора = ПолучитьПартии(ТекущаяСтрока.Номенклатура);
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Партии отсутствуют";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПартии(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиТоваровОстатки.Партия КАК Партия
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Номенклатура = &Номенклатура) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокПартий = Новый СписокЗначений;
	СписокПартий.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("Партия"));
	
	Возврат СписокПартий;
	
КонецФункции

&НаКлиенте
Процедура ТоварыСрокГодностиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.СрокГодности = ВыбранноеЗначение;
КонецПроцедуры
